Перем КомПорт Экспорт;   
Перем ДлинаМасДанных Экспорт;

Процедура ПередНачаломРаботыСистемы(Отказ)
	ДлинаМасДанных = 6;
КонецПроцедуры



Процедура ОткрытьПорт(НомерПорта) Экспорт
	Попытка
		КомПорт = Новый COMОбъект("MsCommLib.MsComm");
		//КомПорт = Новый COMОбъект("MSCOMMLib.MSComm.1");
	Исключение
	    Сообщить("Не удалось создать COMОбъект MsCommLib.MsComm",
		СтатусСообщения.Внимание);
		Сообщить(ОписаниеОшибки(), СтатусСообщения.Внимание);
		Возврат;
	КонецПопытки;
	
	КомПорт.CommPort   = НомерПорта;
	КомПорт.Settings   = "9600,N,8,1";
	КомПорт.RThreshold = 1;
	КомПорт.InputMode = 1;//бинарно
	
	Попытка
		КомПорт.PortOpen = Истина;
	Исключение
		Сообщить("Порт занят");
		Возврат;
	КонецПопытки;	
	
	//ДобавитьОбработчик КомПорт.OnComm, ПолученыДанные;
	
	Сообщить("Порт открыт"); 
КонецПроцедуры

Процедура ЗакрытьПорт() Экспорт//проверить открыт ли он
	Если КомПорт.PortOpen Тогда
		КомПорт.PortOpen = Ложь;
	КонецЕсли;
	КомПорт = Неопределено;
	Сообщить("Порт закрыт");
КонецПроцедуры

Процедура ОтправитьКоманду(ComSafeArray) Экспорт
	ComSafeArray.SetValue(5, КонтрСумма(ComSafeArray) );
	КомПорт.output = ComSafeArray;
	
КонецПроцедуры	

//Процедура ПолученыДанные() 
//	
//	ComSafeArray = КомПорт.input;
//	//
//	Если (ComSafeArray.GetDimensions() <> 1) Тогда
//		Сообщить("ОШИБКА: неверное число измерений COM массива");
//		Возврат;
//	КонецЕсли;
//	
//	Если (ComSafeArray.GetLength() <> ДлинаМасДанных) Тогда
//		Сообщить("ОШИБКА: неверная длина COM массива: "+
//		ComSafeArray.GetLength() );
//		Возврат;
//	КонецЕсли;
//	//
//	ИндМин = ComSafeArray.GetLowerBound(0);
//    ИндМакс = ComSafeArray.GetUpperBound(0);	
//	РеквТекст = "";
//	
//	Если ( ComSafeArray.GetValue(ИндМакс) <> КонтрСумма(ComSafeArray) ) Тогда
//		Сообщить("ОШИБКА: неверная контрольная сумма: расчитано " + КонтрСумма(ComSafeArray) + ", " +
//		+ " получено " + ComSafeArray.GetValue(ИндМакс)
//		);
//		Возврат;
//	КонецЕсли; 
//
//	//
//	Если ComSafeArray.GetValue(ИндМин)=202 Тогда//CA
//		РеквТекст = "Собеседник на свзяи";
//		
//				
//	ИначеЕсли ComSafeArray.GetValue(ИндМин)=221 Тогда//DD
//		РеквТекст = "Собеседник прислал данные";
//		Для Инд = ИндМин+1 по ИндМакс-1 Цикл
//			ЭлементМассива = ComSafeArray.GetValue(Инд);
//			РеквТекст = РеквТекст + " | " + ЭлементМассива;
//		КонецЦикла;
//		
//	ИначеЕсли ComSafeArray.GetValue(ИндМин)=204 Тогда//CС
//		РеквТекст = "Собеседник желает проверить связь";
//        ОтправитьКоманду( КмдШаблон_СвязьПодтвердить_СА_новая() );	
//		
//	КонецЕсли;
//			
//КонецПроцедуры

//--------------------------------------------кнопки ХХХХХХ

Процедура СвязьПроверка() Экспорт
	
	ОтправитьКоманду( КмдШаблон_СвязьПроверить_СС() );
	
КонецПроцедуры

Процедура ИзмерениеЗапрос() Экспорт
	
	ОтправитьКоманду( КмдШаблон_ИзмерениеЗапрос_DF() );
	
КонецПроцедуры

//-----------------------------------------------команды сервис

Функция КонтрСумма(Знач ComSafeArray) Экспорт
	Сумма = 0;
	
	Для Инд = 0 по ДлинаМасДанных-1-1 Цикл
			Сумма = Сумма + ComSafeArray.GetValue(Инд);
	КонецЦикла;
		
	Возврат Сумма % 256;	

КонецФункции	

Функция ComSafeArray_С_Нулями() Экспорт
	
	ComSafeArray = Новый COMSafeArray("VT_UI1", ДлинаМасДанных);
	Для Каждого Элем из ComSafeArray Цикл
		Элем = 0;
	КонецЦикла;
	Возврат ComSafeArray; 
	
КонецФункции

Функция КмдШаблон_СвязьПодтвердить_СА_новая() Экспорт
	
	ComSafeArray = ComSafeArray_С_Нулями();
	ComSafeArray.SetValue(0, 202);
	Возврат ComSafeArray;
	
КонецФункции

Функция КмдШаблон_СвязьПроверить_СС() Экспорт
	
	ComSafeArray = ComSafeArray_С_Нулями();
	ComSafeArray.SetValue(0, 204);
	Возврат ComSafeArray;
	
КонецФункции

Функция КмдШаблон_ИзмерениеЗапрос_DF() Экспорт
	
	ComSafeArray = ComSafeArray_С_Нулями();
	ComSafeArray.SetValue(0, 223);
	Возврат ComSafeArray;
	
КонецФункции 
